test/tests/timesteppers/foam_timestepper_sets_foam_dt/buoyantCavity/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    frontAndBack
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    hot
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    cold
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
}


// ************************************************************************* //
